Repository: lmoffat25/LePostClient
Catalog: languages/lepostclient-*.po
Languages: fr_fr

source: Le Post Client Dashboard
fr_fr: Tableau de bord Le Post Client

source: Ideas List
fr_fr: Liste des idées

source: Settings
fr_fr: Paramètres

source: You do not have sufficient permissions to access this page.
fr_fr: Vous n'avez pas les permissions suffisantes pour accéder à cette page.

source: Nonce verification failed.
fr_fr: La vérification du nonce a échoué.

source: API key cannot be empty.
fr_fr: La clé API ne peut pas être vide.

source: API key saved successfully.
fr_fr: Clé API enregistrée avec succès.

source: An unknown error occurred while fetching account information.
fr_fr: Une erreur inconnue s'est produite lors de la récupération des informations du compte.

source: API Key is not set. Please configure it in the settings page.
fr_fr: La clé API n'est pas configurée. Veuillez la configurer dans la page des paramètres.

source: Successfully imported %d idea from CSV.
fr_fr: Idée importée avec succès depuis le CSV.

source: %d rows could not be imported.
fr_fr: %d lignes n'ont pas pu être importées.

source: CSV import completed, but %d rows could not be imported. Please check the file format and content.
fr_fr: Import CSV terminé, mais %d lignes n'ont pas pu être importées. Veuillez vérifier le format et le contenu du fichier.

source: The CSV file was empty or contained no valid data to import.
fr_fr: Le fichier CSV était vide ou ne contenait aucune donnée valide à importer.

source: Could not open the uploaded CSV file for processing.
fr_fr: Impossible d'ouvrir le fichier CSV téléchargé pour le traitement.

source: Security check failed for bulk actions. Please try again.
fr_fr: La vérification de sécurité a échoué pour les actions en lot. Veuillez réessayer.

source: You do not have sufficient permissions to perform this action.
fr_fr: Vous n'avez pas les permissions suffisantes pour effectuer cette action.

source: Settings saved successfully.
fr_fr: Paramètres enregistrés avec succès.

source: Welcome to Le Post Client
fr_fr: Bienvenue sur Le Post Client

source: To get started, please enter your API key below. This key is required to connect to the Le Post service and generate content.
fr_fr: Pour commencer, veuillez saisir votre clé API ci-dessous. Cette clé est nécessaire pour se connecter au service Le Post et générer du contenu.

source: API Key
fr_fr: Clé API

source: Don't have an API key? Get one from %s
fr_fr: Vous n'avez pas de clé API ? Obtenez-en une depuis %s

source: your account page
fr_fr: votre page de compte

source: Save API Key
fr_fr: Enregistrer la clé API

source: Welcome to your dashboard. Here you can find a summary of your account and quick actions.
fr_fr: Bienvenue sur votre tableau de bord. Ici vous pouvez trouver un résumé de votre compte et des actions rapides.

source: Your Credits
fr_fr: Vos crédits

source: Go to Settings
fr_fr: Aller aux paramètres

source: Credits Remaining
fr_fr: Crédits restants

source: You have a monthly limit of %s credits.
fr_fr: Vous avez une limite mensuelle de %s crédits.

source: Buy More Credits
fr_fr: Acheter plus de crédits

source: Post Ideas List
fr_fr: Liste des idées d'articles

source: Add New Idea (Example Button)
fr_fr: Ajouter une nouvelle idée (exemple de bouton)

source: Add New Idea Manually
fr_fr: Ajouter une nouvelle idée manuellement

source: Post Subject
fr_fr: Sujet de l'article

source: Save Idea
fr_fr: Enregistrer l'idée

source: Generate Ideas with AI
fr_fr: Générer des idées avec l'IA

source: Base Subject / Keyword
fr_fr: Sujet de base / Mot-clé

source: Number of Ideas to Generate
fr_fr: Nombre d'idées à générer

source: Generate Ideas
fr_fr: Générer des idées

source: Import Ideas from CSV
fr_fr: Importer des idées depuis CSV

source: First column: Subject (required)
fr_fr: Première colonne : Sujet (obligatoire)

source: Second column: Description (optional)
fr_fr: Deuxième colonne : Description (optionnel)

source: Drag & Drop CSV file here or click to select.
fr_fr: Glissez-déposez un fichier CSV ici ou cliquez pour sélectionner.

source: Import CSV
fr_fr: Importer CSV

source: Select bulk action
fr_fr: Sélectionner une action en lot

source: Bulk actions
fr_fr: Actions en lot

source: Generate Selected
fr_fr: Générer la sélection

source: Edit Selected
fr_fr: Modifier la sélection

source: Delete Selected
fr_fr: Supprimer la sélection

source: Apply
fr_fr: Appliquer

source: %s items
fr_fr: %s éléments

source: Current Page
fr_fr: Page actuelle

source: of
fr_fr: sur

source: Select All
fr_fr: Tout sélectionner

source: Subject
fr_fr: Sujet

source: Status
fr_fr: Statut

source: Creation Date
fr_fr: Date de création

source: Select %s
fr_fr: Sélectionner %s

source: Edit "%s"
fr_fr: Modifier "%s"

source: Edit
fr_fr: Modifier

source: Generate
fr_fr: Générer

source: View Post
fr_fr: Voir l'article

source: Delete "%s"
fr_fr: Supprimer "%s"

source: Delete
fr_fr: Supprimer

source: View Gen. Post
fr_fr: Voir l'article généré

source: No post ideas found.
fr_fr: Aucune idée d'article trouvée.

source: Confirm Post Generation
fr_fr: Confirmer la génération d'article

source: Cancel
fr_fr: Annuler

source: Confirm & Generate
fr_fr: Confirmer et générer

source: Edit Post Idea
fr_fr: Modifier l'idée d'article

source: Save Changes
fr_fr: Enregistrer les modifications

source: Confirm Deletion
fr_fr: Confirmer la suppression

source: Confirm & Delete
fr_fr: Confirmer et supprimer

source: Le Post Client Settings
fr_fr: Paramètres Le Post Client

source: Enter your API key to connect to Le Post Client service.
fr_fr: Saisissez votre clé API pour vous connecter au service Le Post Client.

source: Company Information
fr_fr: Informations de l'entreprise

source: Provide general information about the company. This will be used to guide AI content generation.
fr_fr: Fournissez des informations générales sur l'entreprise. Cela sera utilisé pour guider la génération de contenu IA.

source: Writing Style
fr_fr: Style d'écriture

source: Describe the desired writing style (e.g., formal, casual, witty, technical). This helps tailor the AI output.
fr_fr: Décrivez le style d'écriture souhaité (ex. : formel, décontracté, spirituel, technique). Cela aide à adapter la sortie IA.

source: Save Settings
fr_fr: Enregistrer les paramètres

source: Theme cannot be empty for AI idea generation.
fr_fr: Le thème ne peut pas être vide pour la génération d'idées IA.

source: Number of ideas must be positive.
fr_fr: Le nombre d'idées doit être positif.

source: An unknown error occurred while generating AI ideas.
fr_fr: Une erreur inconnue s'est produite lors de la génération d'idées IA.

source: An unexpected error occurred while generating ideas.
fr_fr: Une erreur inattendue s'est produite lors de la génération d'idées.

source: Your LePost API key for authentication
fr_fr: Votre clé API LePost pour l'authentification

source: Timeout in seconds for API requests (between 30-600 seconds)
fr_fr: Délai d'attente en secondes pour les requêtes API (entre 30-600 secondes)

source: Information about your company to use in generated content
fr_fr: Informations sur votre entreprise à utiliser dans le contenu généré

source: Preferred writing style for generated content
fr_fr: Style d'écriture préféré pour le contenu généré

source: API key cannot be empty
fr_fr: La clé API ne peut pas être vide
